In [1]:
#DataFrame表示的是矩阵的数据表，它包含已排序的列结合，每一列可以是不同的值类型。DataFrame既有行索引也有列索引。
#可以被视为一个共享相同索引的Series的字典，在Dataframe中，数据被存储为一个以上的二维块。

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
from pandas import Series, DataFrame

In [5]:
data = {'state' : ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],   #使用包含等长度列表或NumPy数组的字典形成Dataframe
       'year' : [2000, 2001, 2002, 2001, 2002, 2003],
       'pop' : [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [6]:
frame = DataFrame(data)

In [7]:
frame            #产生的DataFrame自动为Series分配索引，并且列会按照排序的顺序排列

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [8]:
frame.head()        #对于大型DataFrame，head()将只选出头部的五行

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [9]:
DataFrame(data, columns = ['year', 'state', 'pop'])     #可以指定列顺序

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [10]:
frame2 = DataFrame(data, columns = ['year', 'state', 'pop', 'debt'],         #传入的列不包含在字典中，将会在结果中出现缺失值
                  index = ['one', 'two', 'three', 'four', 'five', 'six'])

In [11]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [12]:
frame2['state']        #索引出列, 索引为Series

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [13]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [14]:
frame2.loc['three']     #索引出行

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [15]:
frame2['debt'] = np.arange(6.)          #可以进行赋值, 将数组赋值给列时，值的长度必须和DataFrame的长度相匹配

In [16]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

In [17]:
val = Series([-1.2, -1.5, -1.7], index = ['four', 'two', 'five'])       
#将Series赋值给一列时，Series的索引将会按照DataFrame的索引重新排列，并在空缺的地方填充缺失值

In [18]:
frame2['debt'] = val

In [19]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.5
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.2
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [20]:
frame2['eastern'] = frame2.state == 'Ohio'    #赋值的列不存在生成新列

In [21]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.5     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.2    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [22]:
del frame2['eastern']

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [24]:
pop = {'Nevada' : {2001 : 2.4, 2002 : 2.9}, 'Ohio' : {2000 : 1.5, 2001 : 1.7, 2002 : 3.6}}

In [25]:
frame3 = DataFrame(pop)      #字典的键作为列，将内部字典的键作为行索引

In [26]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [27]:
frame3.T            #调换行和列

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [28]:
DataFrame(pop, index = pd.Index([2001, 2002, 2003]))

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [29]:
pdata = {'Ohio' : frame3['Ohio'][:-1],
        'Nevada' : frame3['Nevada'][:2]}

In [30]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

In [31]:
frame3.index.name = 'year'
frame3.columns.name = 'state'

In [32]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [33]:
frame3.values

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [34]:
frame2.values        #values会自动选择适合所有列的类型

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.5],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.2],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)

In [ ]:
#pandas中的索引对象是用于存储轴标签和其他元数据的。

In [35]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [36]:
index = obj.index

In [37]:
index

Index(['a', 'b', 'c'], dtype='object')

In [38]:
index[1:]         #索引对象是不可变的, 用户无法修改索引对象

Index(['b', 'c'], dtype='object')

In [39]:
index[1] = 'd'

TypeError: Index does not support mutable operations

In [40]:
labels = pd.Index(np.arange(3))

In [41]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [42]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [43]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [44]:
obj2.index is labels

True

In [45]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [46]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [47]:
'Ohio' in frame3.columns

True

In [48]:
2003 in frame3.index

False

In [50]:
dup_labels = pd.Index(['foo', 'foo', 'bar', 'bar'])

In [51]:
dup_labels             #pandas索引对象可包含重复标签

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')